; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 740225 2 3 4 3 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared2 - mode
	infrared0 - mode
	thermograph1 - mode
	spectrograph3 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 infrared2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument2 infrared2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
)
(:goal (and
	(pointing satellite0 Phenomenon8)
	(pointing satellite1 Planet5)
	(have_image Star3 infrared0)
	(have_image Phenomenon4 thermograph1)
	(have_image Planet5 thermograph1)
	(have_image Phenomenon6 spectrograph3)
	(have_image Star7 thermograph1)
	(have_image Phenomenon8 infrared2)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (turn_to satellite1 star7 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star7)
   goals met: 0 of 8
4. (turn_to satellite0 star3 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star3)
   goals met: 0 of 8
5. (turn_to satellite0 groundstation2 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 8
6. (turn_to satellite1 planet5 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet5)
   goals met: 1 of 8
7. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 8
8. (turn_to satellite1 groundstation2 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 8
9. (turn_to satellite0 phenomenon8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon8)
   goals met: 1 of 8
10. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 1 of 8
11. (take_image satellite0 phenomenon8 instrument0 infrared2)
   added: (have_image phenomenon8 infrared2)
   goals met: 2 of 8
12. (turn_to satellite1 star7 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star7)
   goals met: 2 of 8
13. (take_image satellite1 star7 instrument2 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 3 of 8
14. (turn_to satellite0 star3 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star3)
   goals met: 2 of 8
15. (turn_to satellite1 planet5 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet5)
   goals met: 3 of 8
16. (take_image satellite0 star3 instrument0 infrared0)
   added: (have_image star3 infrared0)
   goals met: 4 of 8
17. (take_image satellite1 planet5 instrument2 thermograph1)
   added: (have_image planet5 thermograph1)
   goals met: 5 of 8
18. (turn_to satellite0 phenomenon8 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon8)
   goals met: 6 of 8
19. (turn_to satellite1 phenomenon4 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon4)
   goals met: 5 of 8
20. (turn_to satellite0 phenomenon6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 8
21. (take_image satellite1 phenomenon4 instrument2 thermograph1)
   added: (have_image phenomenon4 thermograph1)
   goals met: 5 of 8
22. (take_image satellite0 phenomenon6 instrument0 spectrograph3)
   added: (have_image phenomenon6 spectrograph3)
   goals met: 6 of 8
23. (turn_to satellite0 phenomenon8 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon8)
   goals met: 7 of 8
24. (turn_to satellite1 planet5 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 planet5)
   goals met: 8 of 8
